In [2]:
import pandas as pd

In [6]:
pd.read_excel("deneme.xlsx")

  Unnamed: 0   maas   yas  departman
0       atıl   1221  43.0    yazılım
1     zeynep   2122   4.0      satış
2     mehmet    343  33.0        NaN
3      ahmet  33234  43.0  pazarlama
4      atlas   2323   NaN     finans
5      fatma    323  12.0      hukuk

In [8]:
df = pd.read_excel("deneme.xlsx")

In [10]:
df

  Unnamed: 0   maas   yas  departman
0       atıl   1221  43.0    yazılım
1     zeynep   2122   4.0      satış
2     mehmet    343  33.0        NaN
3      ahmet  33234  43.0  pazarlama
4      atlas   2323   NaN     finans
5      fatma    323  12.0      hukuk

In [14]:
yenidf = df.dropna()

In [16]:
yenidf

  Unnamed: 0   maas   yas  departman
0       atıl   1221  43.0    yazılım
1     zeynep   2122   4.0      satış
3      ahmet  33234  43.0  pazarlama
5      fatma    323  12.0      hukuk

In [18]:
yenidf.to_excel("yenimaas.xlsx")

In [ ]:
## read_csv ve to_csv --->>>>>>> for CSV